notes/meeting_2021sep26.org
* meeting notes September 16, 2021
** the usual links:
*** meeting notes
**** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021sep26.md
*** code examples:
**** https://github.com/doomvox/raku-study/tree/main/bin/2021sep26
** battle plan
*** bin pre-loaded with small ammo
*** nano-lightning talk: given-when vs multi-dispatch
**** https://github.com/doomvox/raku-study/tree/main/bin/2021sep26/01-the_given_when_case.raku
**** https://github.com/doomvox/raku-study/tree/main/bin/2021sep26/02-the_multi_dispatch_case.raku
***** TODO benchmark: add a repetition argument, run with "time" 
***** TODO write an example using overlapping subsets, need 'is default' to break tie
*** once around the net
**** stackoverflow
**** perl6-users
**** Raku weekly
**** rosettacode
*** the ephemeral miniconf: nov 18 2021
**** how's it shaping up?
** next meeting
*** next meeting: Oct 10, 2021
