notes/meeting_2021sep26.md
- [meeting notes September 16, 2021](#orgc509ae6)
  - [the usual links:](#org1d2f608)
    - [meeting notes](#orgd4c4aff)
    - [code examples:](#org16acb0c)
  - [battle plan](#orga5c6009)
    - [bin pre-loaded with small ammo](#org46162c0)
    - [nano-lightning talk: given-when vs multi-dispatch](#orgb642808)
    - [once around the net](#org54671a1)
    - [the ephemeral miniconf: nov 18 2021](#org390a7de)
  - [next meeting](#org5e896e2)
    - [next meeting: Oct 10, 2021](#orgd9b7020)


<a id="orgc509ae6"></a>

# meeting notes September 16, 2021


<a id="org1d2f608"></a>

## the usual links:


<a id="orgd4c4aff"></a>

### meeting notes

1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021sep26.md>


<a id="org16acb0c"></a>

### code examples:

1.  <https://github.com/doomvox/raku-study/tree/main/bin/2021sep26>


<a id="orga5c6009"></a>

## battle plan


<a id="org46162c0"></a>

### bin pre-loaded with small ammo


<a id="orgb642808"></a>

### nano-lightning talk: given-when vs multi-dispatch

1.  <https://github.com/doomvox/raku-study/tree/main/bin/2021sep26/01-the_given_when_case.raku>

2.  <https://github.com/doomvox/raku-study/tree/main/bin/2021sep26/02-the_multi_dispatch_case.raku>

    1.  TODO benchmark: add a repetition argument, run with "time"
    
    2.  TODO write an example using overlapping subsets, need 'is default' to break tie


<a id="org54671a1"></a>

### once around the net

1.  stackoverflow

2.  perl6-users

3.  Raku weekly

4.  rosettacode


<a id="org390a7de"></a>

### the ephemeral miniconf: nov 18 2021

1.  how's it shaping up?


<a id="org5e896e2"></a>

## next meeting


<a id="orgd9b7020"></a>

### next meeting: Oct 10, 2021
